DataProcessors/ПодготовкаКВычетуНДСУчтенногоВСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодготовкаКВычетуНДСУчтенногоВСтоимости</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСДо2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСНаСчете19</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПоОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьНДСПриПередачеНедвижимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДолюВычета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезопаснаяДоляВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаздельныйУчетНДСБезВычетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРегистрацииСводныхСправок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПодготовкаКВычетуНДСУчтенногоВСтоимости/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Период", Период);

	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли; 
	
	ТекущаяДатаПользователя = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаПользователя;
	КонецЕсли;
	
	Период = НачалоКвартала(Период);
	//Ищем партии за последние 3 года
	НачалоПериода = ДобавитьМесяц(Период, -36);
	КонецПериода = Период - 1;
	
	НачалоПериодаПоУмолчанию = НачалоПериода;
	СтавкаНДС = УчетНДСКлиентСервер.ОбщаяСтавкаНДС(ТекущаяДатаПользователя);
	ПредставлениеСистемНалогообложения = "НеВыбранаОрганизация";
	ИспользуетсяНесколькоОрганизаций = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	ЗаполнитьЗаголовокНачальнойПодсказки();
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверкаНаличияСохраненныхДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если СтрНайти(ИмяСобытия, "ПодготовкаКВычетуНДС") = 0 Тогда 
		Возврат
	КонецЕсли;

	Если ИмяСобытия = "ПодготовкаКВычетуНДСОбновитьПослеДозаполнения" Тогда
		ЗагрузитьСхраненныеДанные();
	ИначеЕсли ИмяСобытия = "ПодготовкаКВычетуНДСИзменениеПериода" Тогда 
		НачалоПериода	= Параметр;
		СтавкаНДС		= УчетНДСКлиентСервер.ОбщаяСтавкаНДС(КонецПериода);
		ОбновитьЗаголовокДекорацияПериод();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();
	ПроверкаНаличияСохраненныхДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
										СтандартнаяОбработка)
	
	Если Организация = ВыбранноеЗначение Тогда 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ДокументыВводаОстатков" Тогда
		
		ПараметрыДляОткрытияФормы = Новый Структура;
		ПараметрыДляОткрытияФормы.Вставить("Организация", Организация);
		ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.ДокументыВводНачальныхОстатков", 
			ПараметрыДляОткрытияФормы, ЭтотОбъект);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокСчетовПоиска" Тогда 	
	
		ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.СписокСчетовПоискаОстатков", , 
			ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьПериод" Тогда 	
	
		ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода, Организация, НачалоПериодаПоУмолчанию", 
			НачалоПериода, ДатаПерехода, Организация, НачалоПериодаПоУмолчанию);
		ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.ФормаИзмененияПериода", 
			ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодготовитьНДСКВычетуНажатие(Команда)

	Если ПроизведенПоискНДС Тогда 

		ОписаниеОповещения = Новый ОписаниеОповещения("ПовторнаяПОдготовкаКВычету", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru='При повторной подготовке НДС к вычету
			|заполненные ранее сведения будут очищены, 
			|документы ввода остатков будут сформированы заново'");
		
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить("ПодготовитьНДСКВычету", "Подготовить НДС к вычету");
		СписокОтветов.Добавить("Отмена", "Отмена");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокОтветов);
	
	Иначе 
		
		ПодготовитьНДСКВычету();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИДозаполнитьДанные(Команда)
	
	СохранитьВХранилище();
	ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.ФормаДозаполненияДанных", 
	РеквизитыФормы(), ЭтотОбъект, "ФормаДозаполненияДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОперацию(Команда) Экспорт
	
	ОтменитьОперациюСервер(ВыполняемаяОперация);
	ВыполняетсяПоискДанных = Ложь;
	ПроизведенПоискНДС = Ложь;
	ЗагрузитьСхраненныеДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура ОтменитьОперациюСервер(ВыполняемаяОперация)
	
	Если ВыполняемаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ВыполняемаяОперация.ИдентификаторЗадания);

КонецПроцедуры

&НаКлиенте 
Функция ИнициализироватьОписаниеОперации()
	
	ОписаниеОперации = Новый Структура;
	ОписаниеОперации.Вставить("ПредставлениеЭтапа", "");
	ОписаниеОперации.Вставить("НаименованиеФоновогоЗадания", "");
	ОписаниеОперации.Вставить("ОбработчикПриВыполнении", "");
	ОписаниеОперации.Вставить("ИмяПроцедуры", "");
	ОписаниеОперации.Вставить("ПредставлениеПрогрессаВидимость", Ложь);
	ОписаниеОперации.Вставить("ВыгружатьНДСПоОстаткам", Ложь);
	ОписаниеОперации.Вставить("ЗагружатьНДСПоОстаткам", Ложь);
	Возврат ОписаниеОперации
	
КонецФункции

&НаКлиенте
Функция ИмяПроцедуры(ИмяМетода)
	
	Возврат СтрШаблон("Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.%1", ИмяМетода);
	
КонецФункции

&НаКлиенте 
Процедура ПроверкаНаличияСохраненныхДанных()
	
	Если ПредставлениеСистемНалогообложения = "УСНСВычетами" Тогда 
		
		ВыполняетсяПоискДанных = Истина;
		ОписаниеОперации = ИнициализироватьОписаниеОперации();
		ОписаниеОперации.ПредставлениеЭтапа = НСтр("ru = 'Выполняется поиск ранее подготовленных данных'");
		ОписаниеОперации.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка наличия сохраненных данных'");
		ОписаниеОперации.ОбработчикПриВыполнении = "ПоказатьРезультатПоискаСохраненных";
		ОписаниеОперации.ИмяПроцедуры = ИмяПроцедуры("ПроверкаНаличияСохраненныхДанных");
		
		ВыполнитьВФоне(ОписаниеОперации);
		
	Иначе 
		
		ВыполняетсяПоискДанных = Ложь;
		УстановитьВидимостьИДоступность();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьПредставлениеСистемыНалогообложения();
	ОбновитьЗаголовокДекорацияПериод();
	НДСПоОстаткам.Очистить();
	ВыполняетсяПоискДанных = Истина;
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяПодготовкаКВычету(Результат, Параметры) Экспорт
	
	Если Результат = "ПодготовитьНДСКВычету" Тогда
		ПодготовитьНДСКВычету();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеСистемыНалогообложенияЗаголовок()
	
	Если ПредставлениеСистемНалогообложения = "НеВыбранаОрганизация" Тогда 
		Возврат НСтр("ru = 'Не выбрана организация'");
	ИначеЕсли ПредставлениеСистемНалогообложения = "НеЗаполнена" Тогда
		Возврат НСтр("ru = 'У выбранной организации не заполнена система налогообложения'");
	ИначеЕсли ПредставлениеСистемНалогообложения = "УСНСВычетами" Тогда
		Возврат СтрШаблон(НСтр("ru = 'Организация с УСН %1'"), УчетНДСКлиентСервер.ОбщаяСтавкаНДС(Период));
	ИначеЕсли ПредставлениеСистемНалогообложения = "УСНБезНДС" Тогда
		Возврат НСтр("ru = 'Организация применяет упрощенную систему налогообложения (УСН) без уплаты НДС'");
	ИначеЕсли ПредставлениеСистемНалогообложения = "УСН5" Тогда
		Возврат НСтр("ru = 'Организация применяет упрощенную систему налогообложения (УСН) и уплачивает НДС по ставке 5%'");
	ИначеЕсли ПредставлениеСистемНалогообложения = "УСН7" Тогда
		Возврат НСтр("ru = 'Организация применяет упрощенную систему налогообложения (УСН) и уплачивает НДС по ставке 7%'");
	ИначеЕсли ПредставлениеСистемНалогообложения = "ОСНО" Тогда
		Возврат НСтр("ru = 'Организация не применяет упрощенную систему налогообложения (УСН)'");
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если ИспользуетсяНесколькоОрганизаций ИЛИ ПредставлениеСистемНалогообложения = "НеВыбранаОрганизация" Тогда
		Элементы.ДекорацияВыберитеОрганизацию.Видимость	= Истина;
		Элементы.Организация.Видимость					= Истина;
	Иначе
		Элементы.ДекорацияВыберитеОрганизацию.Видимость	= Ложь;
		Элементы.Организация.Видимость					= Ложь;
	КонецЕсли;
	
	Если ВыполняетсяПоискДанных Тогда 
		
		ОтобразитьСтатус("ПожалуйстаПодождите");
		Элементы.ПредставлениеСистемыНалогообложения.Видимость	= Ложь;
		Элементы.ГруппаПодготовитьКВычету.Видимость				= Ложь;
		Элементы.Результат.Видимость							= Ложь;
		
	ИначеЕсли ПредставлениеСистемНалогообложения = "НеВыбранаОрганизация" Тогда
		
		ОтобразитьСтатус();
		Элементы.ПредставлениеСистемыНалогообложения.Видимость	= Ложь;
		Элементы.ГруппаПодготовитьКВычету.Видимость				= Ложь;
		Элементы.Результат.Видимость							= Ложь;
		
	ИначеЕсли МенялисьДокументыОстатков Тогда
		
		ОтобразитьСтатус("МенялисьДокументыОстатков");
		Элементы.ПредставлениеСистемыНалогообложения.Видимость	= Ложь;
		Элементы.ГруппаПодготовитьКВычету.Видимость				= Истина;
		Элементы.Результат.Видимость							= Ложь;
		
	ИначеЕсли ПредставлениеСистемНалогообложения = "УСНСВычетами" Тогда
		
		Если ПроизведенПоискНДС 
				И (СуммаПодготовленоКВычету + СуммаНеХватаетДанныхДляВычета + СуммаВычетНедоступен) = 0 Тогда 
			ОтобразитьСтатус("НетОстатков");
		Иначе 
			ОтобразитьСтатус();
		КонецЕсли;
		Элементы.ПредставлениеСистемыНалогообложения.Видимость = Ложь;
		Элементы.Результат.Видимость = Истина;
		Элементы.ГруппаПодготовитьКВычету.Видимость = Истина;
		
		Если ПроизведенПоискНДС Тогда  
			Элементы.ПроверитьИДозаполнитьДанные.КнопкаПоУмолчанию = Истина;
		Иначе 	
			Элементы.КнопкаПодготовитьНДСКВычету.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
		
		//В зависимости от наличия сумм отображаем соответствующие группы
		Элементы.ГруппаПодготовленоКВычету.Видимость = СуммаПодготовленоКВычету > 0;
		Элементы.ГруппаНеХватаетДанныхДляВычета.Видимость = СуммаНеХватаетДанныхДляВычета > 0;
		Элементы.ГруппаВычетНедоступен.Видимость = СуммаВычетНедоступен > 0;
		
		Если КоличествоПартийНеХватаетДанныхДляВычета > 0 Тогда 
			ДозаполнитьПодсказка = СтрШаблон(НСтр("ru = 'В %1 не выделен НДС и/или не зарегистрированы счета-фактуры.
				|Необходимо указать ставку НДС и заполнить реквизиты для регистрации счета-фактуры.'"), 
				ПолучитьСклоненияСтрокиПоЧислу("", КоличествоПартийНеХватаетДанныхДляВычета, "документ", "ЧС=Количественное",
					"ПД=Предложный")[0]);
		Иначе 
			ДозаполнитьПодсказка = 
				НСтр("ru = 'По остаткам ценностей найдены документы, в которых не выделен НДС и/или не зарегистрированы счета-фактуры.
					|Необходимо указать ставку НДС и заполнить реквизиты для регистрации счета-фактуры.'");
		КонецЕсли;
		
		Элементы.ТекстПодсказкаНеХватаетДанныхДляВычета.Заголовок = ДозаполнитьПодсказка;
		Элементы.СуммаПодготовленоКВычету.Заголовок = СуммаВЗаголовке(СуммаПодготовленоКВычету);
		Элементы.СуммаНеХватаетДанныхДляВычета.Заголовок = СуммаВЗаголовке(СуммаНеХватаетДанныхДляВычета);
		Элементы.СуммаВычетНедоступен.Заголовок = СуммаВЗаголовке(СуммаВычетНедоступен);
		
	Иначе
		
		ОтобразитьСтатус();
		Элементы.ПредставлениеСистемыНалогообложения.Видимость = Истина;
		Элементы.ПредставлениеСистемыНалогообложения.Заголовок = ПредставлениеСистемыНалогообложенияЗаголовок();
		Элементы.ГруппаПодготовитьКВычету.Видимость = Ложь;
		Элементы.Результат.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтатус(ИмяСтатуса = "")
	
	Для Каждого БаннерСтатуса Из Элементы.ГруппаСтатусы.ПодчиненныеЭлементы Цикл 
		БаннерСтатуса.Видимость = Ложь;
	КонецЦикла;
	
	Если ИмяСтатуса = "" Тогда 
		Возврат
	ИначеЕсли НЕ Элементы.Найти(СтрШаблон("Баннер%1", ИмяСтатуса)) = Неопределено Тогда 
		Элементы[СтрШаблон("Баннер%1", ИмяСтатуса)].Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СуммаВЗаголовке(Сумма) 

	Возврат Формат(Сумма, "ЧЦ=15; ЧДЦ=2")

КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеСистемыНалогообложения()
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ПредставлениеСистемНалогообложения = "НеВыбранаОрганизация";
		Возврат;
	КонецЕсли;
	
	Если УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Организация, Период) Тогда 
		ПредставлениеСистемНалогообложения = "УСНСВычетами";
		ДатаПерехода = Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.ДатаПереходаНаУСНСВычетами(Организация, Период);
		КонецПериода = ДатаПерехода - 1;
	ИначеЕсли УчетнаяПолитика.СистемаНалогообложения(Организация, Период) = Перечисления.СистемыНалогообложения.Общая Тогда
		ПредставлениеСистемНалогообложения = "ОСНО";
	Иначе 
		СтавкаНалогообложенияПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(Организация, Период);
		Если СтавкаНалогообложенияПриУСН = Перечисления.ВидыСтавокНДС.ПониженнаяУСН Тогда
			ПредставлениеСистемНалогообложения = "УСН5";
		ИначеЕсли СтавкаНалогообложенияПриУСН = Перечисления.ВидыСтавокНДС.ОбщаяУСН Тогда
			ПредставлениеСистемНалогообложения = "УСН7";
		Иначе 
			ПредставлениеСистемНалогообложения = "УСНБезНДС";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокДекорацияПериод()
	
	Если НачалоПериода = НачалоПериодаПоУмолчанию Тогда 
		Элементы.ДекорацияПериод.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'За период '"), 
			Новый ФорматированнаяСтрока(НСтр("ru='3 года'"), , , , "ИзменитьПериод"), 
			НСтр("ru = ' (по умолчанию)'"));
			ПредставлениеПериода = Новый ФорматированнаяСтрока(НСтр("ru='по умолчанию 3 года'"), , , , "ИзменитьПериод");
	Иначе 
		Элементы.ДекорацияПериод.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'За период '"), 
			Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'с %1 по %2'"), 
			Формат(НачалоПериода, "ДЛФ=Д"), 
			Формат(ДатаПерехода-1, "ДЛФ=Д")), , , , "ИзменитьПериод"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммы()

	СохранитьВХранилище();
	
	ИтоговыеСуммы = Новый Структура; 
	
	СуммаПодготовленоКВычету = 0;
	СуммаНеХватаетДанныхДляВычета = 0;
	СуммаВычетНедоступен = 0;
	КоличествоПартийНеХватаетДанныхДляВычета = 0;
	
	Если НЕ ПроизведенПоискНДС Тогда 
		УстановитьВидимостьИДоступность();
		Возврат
	КонецЕсли;
	
	НДСПодготовленыйКВычету = Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.НДСПодготовленыйКВычету(РеквизитыФормы());
	Если НДСПодготовленыйКВычету.Количество() > 0 Тогда 
		СуммаПодготовленоКВычету = НДСПодготовленыйКВычету.Итог("СуммаНДС");
	КонецЕсли;
	
	ТаблицаНДСПоОстаткам = НДСПоОстаткам.Выгрузить();
	СтрокиПодготовлен = ТаблицаНДСПоОстаткам.НайтиСтроки(Новый Структура("Статус", "Подготовлен"));
	Для Каждого СтрокаПодготовлен Из СтрокиПодготовлен Цикл 
		ТаблицаНДСПоОстаткам.Удалить(СтрокаПодготовлен);
	КонецЦикла;
	НДСПоОстаткам.Загрузить(ТаблицаНДСПоОстаткам);
	
	Для Каждого Строка Из НДСПоОстаткам Цикл 
		Если Строка.Группа = "НеХватаетДанныхДляВычета" Тогда 
			Если Строка.СуммаНДС = 0 Тогда 
				СуммаНеХватаетДанныхДляВычета = СуммаНеХватаетДанныхДляВычета + Строка.РасчетныйНДС;
			Иначе 
				СуммаНеХватаетДанныхДляВычета = СуммаНеХватаетДанныхДляВычета + Строка.СуммаНДС;
			КонецЕсли; 
		Иначе 
			Если Строка.СуммаНДС = 0 Тогда 
				СуммаВычетНедоступен = СуммаВычетНедоступен + Строка.РасчетныйНДС;
			Иначе 
				СуммаВычетНедоступен = СуммаВычетНедоступен + Строка.СуммаНДС;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	СтрокиНеХватаетДанныхДляВычета = НДСПоОстаткам.НайтиСтроки(Новый Структура("Группа", "НеХватаетДанныхДляВычета"));
	НеХватаетДанныхДляВычетаПартии = НДСПоОстаткам.Выгрузить(СтрокиНеХватаетДанныхДляВычета, "Партия");
	НеХватаетДанныхДляВычетаПартии.Свернуть("Партия");
	КоличествоПартийНеХватаетДанныхДляВычета = НеХватаетДанныхДляВычетаПартии.Количество();
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСхраненныеДанные(Результат = Неопределено)
	
	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.ЗагрузитьСхраненныеДанные(ЭтотОбъект);
	ВыполняетсяПоискДанных = Ложь;
	ПроизведенПоискНДС = Истина;
	ОбновитьСуммы();

КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьНДСКВычету()
	
	Оповестить("ПодготовкаКВычетуНДСЗакрытьФормуДозаполнения");
	НДСПоОстаткам.Очистить();
	ПроизведенПоискНДС = Ложь;
	ВыполняетсяПоискДанных = Истина;
	МенялисьДокументыОстатков = Ложь;
	УстановитьВидимостьИДоступность();
	
	ОтменаРезультатаВыполнения = ИнициализироватьОписаниеОперации();
	ОтменаРезультатаВыполнения.Вставить("ПредставлениеЭтапа",
		НСтр("ru = 'Выполняется удаление ранее созданых документов'"));
	ОтменаРезультатаВыполнения.Вставить("НаименованиеФоновогоЗадания", НСтр("ru = 'Отмена результата выполнения'"));
	ОтменаРезультатаВыполнения.Вставить("ИмяПроцедуры", ИмяПроцедуры("ОтменаРезультатаВыполнения"));
	
	ПоискНДСПоОстаткам = ИнициализироватьОписаниеОперации();
	ПоискНДСПоОстаткам.Вставить("ПредставлениеЭтапа", НСтр("ru = 'Выполняется поиск НДС, учтенного в стоимости'"));
	ПоискНДСПоОстаткам.Вставить("НаименованиеФоновогоЗадания", НСтр("ru = 'Поиск НДС по остаткам'"));
	ПоискНДСПоОстаткам.Вставить("ИмяПроцедуры", ИмяПроцедуры("ПоискНДСПоОстаткам"));
	ПоискНДСПоОстаткам.Вставить("ЗагружатьНДСПоОстаткам", Истина);
	ПоискНДСПоОстаткам.Вставить("ПредставлениеПрогрессаВидимость", Истина);
	
	СозданиеДокументовВводаОстатков = ИнициализироватьОписаниеОперации();
	СозданиеДокументовВводаОстатков.Вставить("ПредставлениеЭтапа",
		НСтр("ru = 'Выполняется создание документов ввода остатков'"));
	СозданиеДокументовВводаОстатков.Вставить("НаименованиеФоновогоЗадания",
		НСтр("ru = 'Создание документов ввода остатков'"));
	СозданиеДокументовВводаОстатков.Вставить("ОбработчикПриВыполнении", "ЗагрузитьСхраненныеДанные");
	СозданиеДокументовВводаОстатков.Вставить("ИмяПроцедуры", ИмяПроцедуры("СозданиеДокументовВводаОстатков"));
	СозданиеДокументовВводаОстатков.Вставить("ВыгружатьНДСПоОстаткам", Истина);
	
	ПоискНДСПоОстаткам.Вставить("ОбработчикПриВыполнении", СозданиеДокументовВводаОстатков);
	ОтменаРезультатаВыполнения.Вставить("ОбработчикПриВыполнении", ПоискНДСПоОстаткам);
	
	ВыполнитьВФоне(ОтменаРезультатаВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВФоне(ОписаниеОперации)
	
	Элементы.ДекорацияПредставлениеДлительнойОперации.Заголовок = ОписаниеОперации.ПредставлениеЭтапа;
	ВыполняемаяОперация = ВыполнитьОперациюВФоне(ОписаниеОперации);
	Элементы.ПредставлениеПрогресса.Видимость = ОписаниеОперации.ПредставлениеПрогрессаВидимость;
	Элементы.ПредставлениеПрогресса.Заголовок = "";
	
	Обработчик = Новый ОписаниеОповещения("ОбработчикОповещения", ЭтотОбъект, ОписаниеОперации);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	ДополнительныеПараметры = Новый Структура;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПриОбновленииПрогрессаФоновогоЗадания", 
		ЭтотОбъект, ДополнительныеПараметры);
			
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ВыполняемаяОперация, Обработчик, НастройкиОжидания);

КонецПроцедуры

&НаСервере
Функция ВыполнитьОперациюВФоне(ОписаниеОперации)
	
	ИмяПроцедуры = ОписаниеОперации.ИмяПроцедуры;
	
	ПараметрыПроцедуры = РеквизитыФормы(ОписаниеОперации.ВыгружатьНДСПоОстаткам);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ОписаниеОперации.НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОповещения(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьРезультат = Ложь;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		ПоказатьРезультат = Истина;
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда 
		
		ПоказатьРезультат = Истина;
		
	КонецЕсли;
	
	Если ПоказатьРезультат Тогда 
		
		ЗагружатьНДСПоОстаткам = Ложь;
		ДополнительныеПараметры.Свойство("ЗагружатьНДСПоОстаткам", ЗагружатьНДСПоОстаткам);
		Если ЗагружатьНДСПоОстаткам Тогда
			ЗагрузитьВНДСПоОстаткамНаСервере(Результат.АдресРезультата);
		КонецЕсли;
		
		ОбработчикПриВыполнении = Неопределено;
		ДополнительныеПараметры.Свойство("ОбработчикПриВыполнении", ОбработчикПриВыполнении);
		
		Если ТипЗнч(ОбработчикПриВыполнении) = Тип("Структура") Тогда 
			ВыполнитьВФоне(ОбработчикПриВыполнении);
		ИначеЕсли ТипЗнч(ОбработчикПриВыполнении) = Тип("Строка") Тогда 
			Если ОбработчикПриВыполнении = "ПоказатьРезультатПоискаСохраненных" Тогда 
				ПоказатьРезультатПоискаСохраненных(Результат);
			ИначеЕсли ОбработчикПриВыполнении = "ЗагрузитьСхраненныеДанные" Тогда 
				ЗагрузитьСхраненныеДанные(Результат);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОбновленииПрогрессаФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Прогресс <> Неопределено Тогда
		Элементы.ПредставлениеПрогресса.Заголовок = Результат.Прогресс.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВНДСПоОстаткамНаСервере(Источник)
	
	НДСПоОстаткам.Очистить();
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда 
		ДанныеХранилища = ПолучитьИзВременногоХранилища(Источник);
		Если ТипЗнч(ДанныеХранилища) = Тип("Структура") И ДанныеХранилища.Свойство("НДСПоОстаткам") Тогда 
			НДСПоОстаткам.Загрузить(ДанныеХранилища.НДСПоОстаткам);
		ИначеЕсли ТипЗнч(ДанныеХранилища) = Тип("ТаблицаЗначений") Тогда 
			НДСПоОстаткам.Загрузить(ДанныеХранилища);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник) = Тип("Структура") И Источник.Свойство("НДСПоОстаткам") Тогда  
		НДСПоОстаткам.Загрузить(Источник.НДСПоОстаткам);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВХранилище()

	Обработки.ПодготовкаКВычетуНДСУчтенногоВСтоимости.СохранитьВХранилище(РеквизитыФормы(Истина));

КонецПроцедуры

&НаСервере
Функция РеквизитыФормы(ВыгружатьНДСПоОстаткам = Ложь)
	
	РеквизитыФормы = Новый Структура();
	РеквизитыФормы.Вставить("Организация", Организация);
	РеквизитыФормы.Вставить("Период", Период);
	РеквизитыФормы.Вставить("НачалоПериода", НачалоПериода);
	РеквизитыФормы.Вставить("КонецПериода", КонецПериода);
	РеквизитыФормы.Вставить("ДатаПерехода", ДатаПерехода);
	РеквизитыФормы.Вставить("СтавкаНДС", СтавкаНДС);
	РеквизитыФормы.Вставить("ЗаполненоАвтоматически", Истина);
	Если ВыгружатьНДСПоОстаткам Тогда 
		РеквизитыФормы.Вставить("НДСПоОстаткам", НДСПоОстаткам.Выгрузить());
	КонецЕсли;
	Возврат РеквизитыФормы;
	
КонецФункции

&НаСервере
Процедура ПоказатьРезультатПоискаСохраненных(Результат)
	
	СтруктураРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ПроизведенПоискНДС = Истина;
	ВыполняетсяПоискДанных = Ложь;
	МенялисьДокументыОстатков = Ложь;
	
	Если СтруктураРезультат <> Неопределено Тогда 
		Если СтруктураРезультат.МенялисьДокументы Тогда 
			МенялисьДокументыОстатков = Истина;
			УстановитьВидимостьИДоступность();
			Возврат;
		Иначе
			ЗагрузитьВНДСПоОстаткамНаСервере(СтруктураРезультат);
		КонецЕсли;
	Иначе 
		ПроизведенПоискНДС = Ложь;
	КонецЕсли;
	ОбновитьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПодготовленоКВычетуНажатие(Элемент)
	
	ОткрытьФормуРасшифровки("ПодготовленоКВычету");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНеХватаетДанныхДляВычетаНажатие(Элемент)
	
	ОткрытьФормуРасшифровки("НеХватаетДанныхДляВычета");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВычетНедоступенНажатие(Элемент)
	
	ОткрытьФормуРасшифровки("ВычетНедоступен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(Группа)
	
	ПараметрыФормирования = ПараметрыФормированияОтчета(Группа);
	КомпоновщикНастроек = ПолучитьКомпоновщикНастроек(ПараметрыФормирования);

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Вариант", КомпоновщикНастроек.Настройки);
	ПараметрыОткрытия.Вставить("КлючВарианта", Группа);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("ПредставлениеВарианта", ПараметрыФормирования.Заголовок);
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
		
	ОткрытьФорму("Отчет.РасшифровкаСуммыПриПодготовкеКВычетуНДСУчтенногоВСтоимости.ФормаОбъекта", ПараметрыОткрытия, );
	
КонецПроцедуры 

&НаСервере
Функция ПараметрыФормированияОтчета(Группа)
	
	ПараметрыФормирования = Новый Структура();
	
	ПараметрыФормирования.Вставить("Группа", Группа);
	Если Группа = "ПодготовленоКВычету" Тогда 
		ПараметрыФормирования.Вставить("Заголовок", НСтр("ru = 'НДС по остаткам подготовленный к вычету'"));
	ИначеЕсли Группа = "НеХватаетДанныхДляВычета" Тогда
		ПараметрыФормирования.Вставить("Заголовок", НСтр("ru = 'Не хватает данных для подготовки НДС к вычету'"));
	ИначеЕсли Группа = "ВычетНедоступен" Тогда
		ПараметрыФормирования.Вставить("Заголовок", НСтр("ru = 'НДС недоступый к вычету'"));
	КонецЕсли;
	
	Возврат ПараметрыФормирования;
	
КонецФункции

&НаСервере
Функция ПолучитьКомпоновщикНастроек(ПараметрыФормирования)
		
	ОтчетОбъект = Отчеты.РасшифровкаСуммыПриПодготовкеКВычетуНДСУчтенногоВСтоимости.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	
	НастройкиВарианта = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ПараметрыФормирования.Группа).Настройки;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	
	НастройкиКолонтитулов = УправлениеКолонтитулами.НастройкиКолонтитулов();
	НастройкиКолонтитулов.ВерхнийКолонтитул.ТекстСправа = ТекущаяДата();
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("НастройкиКолонтитулов", НастройкиКолонтитулов);
	
	ДобавитьПараметрыДанных(КомпоновщикНастроек.Настройки, ПараметрыФормирования);
		
	ДополнительныеСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("Организация", Организация);
	ДополнительныеСвойства.Вставить("ДатаПерехода", ДатаПерехода);
	ДополнительныеСвойства.Вставить("Группа", ПараметрыФормирования.Группа);
	
	Возврат КомпоновщикНастроек;
	
КонецФункции

&НаСервере
Процедура ДобавитьПараметрыДанных(Настройки, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("ТекстЗаголовка", СтрШаблон("%1.%2%3.", Заголовок, Символы.ПС, ПараметрыФормирования.Заголовок));
	СтруктураПараметров.Вставить("ДатаПерехода", ДатаПерехода);
	СтруктураПараметров.Вставить("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода", КонецПериода);
	СтруктураПараметров.Вставить("Группа", ПараметрыФормирования.Группа);

	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого Параметр Из СтруктураПараметров Цикл
		
		ТекущийПараметр   = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
		ТекущийПараметрКД = ПараметрыДанных.Найти(ТекущийПараметр);
		
		Если ТекущийПараметрКД <> Неопределено Тогда
			ТекущийПараметрКД.Использование = Истина;
			ТекущийПараметрКД.Значение = Параметр.Значение;
		Иначе
			ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Добавить();
			ПараметрДанных.Использование = Истина;
			ПараметрДанных.Значение = Параметр.Значение;
			ПараметрДанных.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокНачальнойПодсказки()
	
	Элементы.ДекорацияНачальнаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'При переходе на уплату НДС по общей ставке (%1) налог, ранее включенный в стоимость, можно принять к вычету.'"), 
				СтавкаНДС)), 
		Символы.ПС, 
		Новый ФорматированнаяСтрока(НСтр("ru = 'При подготовке к вычету анализируются остатки материальных ценностей на счетах '")), 
		Новый ФорматированнаяСтрока("07, 08, 10, 41 и 45", , , , "ОткрытьСписокСчетовПоиска"), 
		НСтр("ru = ', рассчитывается сумма НДС, включенная в их стоимость, и формируются документы ""Ввод остатков"" для исключения этой суммы из стоимости.'"));
	
КонецПроцедуры

#КонецОбласти
